greeting_ru = 'Привет, {0} 👋🏻, используй кнопки ниже, чтобы взаимодействовать ⬇️'
greeting_ukr = 'Привіт, {0} 👋🏻, використовуй кнопки нижче, щоб взаємодіяти ⬇️'
greeting_en = 'Hi {0} 👋🏻, use the buttons below to interact ⬇️'

lang_changed_ru = 'Язык был изменен на русский 🇷🇺'
lang_changed_ukr = 'Мова була змінена на Українську 🇺🇦'
lang_changed_en = 'The language was changed to English 🇬🇧'

enter_mobile_ru = 'Введите ваш номер телефона или поделитесть контаком, чтобы продолжить'
enter_mobile_ukr = 'Введіть ваш номер телефону або поделіться вашим контактом, щоб продовжити'
enter_mobile_en = 'Enter your phone number or share contact to continue'

enter_new_mobile_ru = 'Введите ваш новый номер телефона'
enter_new_mobile_ukr = 'Введіть свій новий номер телефону'
enter_new_mobile_en = 'Enter your new phone number'

incorrect_ru = '❌ Некорректный формат'
incorrect_ukr = '❌ Некоректний формат'
incorrect_en = '❌ Invalid format'

error_request = '⚠️ Ошибка запроса'

nothing_found_ru = 'По заказу {0} ничего не найдено 😕'
nothing_found_ukr = 'По заказу {0} нічого не знайдено 😕'
nothing_found_en = 'Nothing found for order {0} 😕'

nothing_found_code_ru = 'По коду {0} ничего не найдено 😕'
nothing_found_code_ukr = 'По коду {0} нічого не знайдено 😕'
nothing_found_code_en = 'Nothing found {0} 😕'

nothing_found_model_ru = 'По модели {0} ничего не найдено 😕'
nothing_found_model_ukr = 'По моделі {0} нічого не знайдено 😕'
nothing_found_model_en = 'Nothing found {0} 😕'

nothing_found_article_ru = 'По запросу {0} ничего не найдено 😕'
nothing_found_article_ukr = 'За запитом {0} нічого не знайдено 😕'
nothing_found_article_en = 'No results were found for {0} 😕'

nothing_found_by_number_ru = 'Я ничего не нашел по номеру телефона {0} 😕'
nothing_found_by_number_ukr = 'Я нічого не знайшов за номером телефону {0} 😕'
nothing_found_by_number_en = 'I did not find anything by phone number {0} 😕'

choose_model_ru = 'Выберете свою модель'
choose_model_ukr = 'Виберете свою модель'
choose_model_en = 'Choose your model'

сhoose_appliance_group_ru = 'Выберите группу товаров'
сhoose_appliance_group_ukr = 'Виберіть групу товарів'
сhoose_appliance_group_en = 'Select group of goods'

this_is_your_number_ru = '''Это ваш номер телефона?
📱 {0}'''
this_is_your_number_ukr = '''Це ваш номер телефону?
📱 {0}'''
this_is_your_number_en = '''Is this your phone number?
📱 {0}'''

enter_artickle_ru = 'Введите артикул позиции (не менее 4 знаков)'
enter_artickle_ukr = 'Введіть артикул позиції (не менше 4-х знаків)'
enter_artickle_en = 'Enter item number (at least 4 characters)'

enter_name_ru = 'Введите название позиции (не менее 4 знаков)'
enter_namw_ukr = 'Введіть назву позиції (не менше 4-х знаків)'
enter_name_en = 'Enter item name (at least 4 characters)'

enter_product_code_ru = 'Введите код товара (5 знаков)'
enter_product_code_ukr = 'Введіть код товару (5 знаків)'
enter_product_code_en = 'Enter the product code (5 characters)'

enter_model_name_ru = 'Введите название модели (не менее 4 знаков)'
enter_model_name_ukr = 'Введіть назву моделі (не менше 4-х знаків)'
enter_model_name_en = 'Enter model name (at least 4 characters)'

searching_ru = 'Ищу...'
searching_ukr = 'Шукаю...'
searching_en = 'Searching...'

searching_results_ru = '🔎 Результаты поиска'
searching_results_ukr = '🔎 Результати пошуку'
searching_results_en = '🔎 Searching results'

finded_ru = '🔎 Найдено {0} товаров'
finded_ukr = '🔎 Знайдено {0} товарів'
finded_en = '🔎 Found {0} products'

what_appliance_type_ru = 'Какой у вас тип техники?'
what_appliance_type_ukr = 'Який у вас тип техніки?'
what_appliance_type_en = 'What type of appliance do you have?'

error_nothing_found_ru = '❌ Ошибка, товар не найден или был удален'
error_nothing_found_ukr = '❌ Помилка, товар не знайдений або був видалений'
error_nothing_found_en = '❌ Error, product not found or has been deleted'

where_model_ru = 'Модель техники указана на специальной наклейке - шильдике. Он содержит информацию о модели, серийном номере, мощности, габаритах устройства и других характеристиках. Подробнее о размещениях наклеек производителя читайте [здесь](https://www.service-market.com.ua/nameplate)'
where_model_ukr = 'Модель техніки вказана на спеціальній наліпці- шильдику. Він містить інформацію про модель, серійний номер, потужність, габарити пристрою та інші характеристики. Детальніше про розміщення наліпок виробника читайте [тут](https://www.service-market.com.ua/ua/nameplate)'
where_model_en = 'The model of appliances is indicated on a special sticker - nameplate. It has information about model, serial number, power, dimensions etc. Read more about the nameplates locations [here](https://www.service-market.com.ua/en/nameplate)'

delivery_method_ru = '''В Сервис-Маркет представлены такие способы доставки:

<b>Новая Почта</b> - доставка в любой уголок Украины.

<b>Самовывоз</b> - доступен в Киеве и Одессе.

<b>Доставка курьером</b> - по Киеву 50 грн, в пригород Киева от 100 грн.'''
delivery_method_ukr = '''В Сервіс-Маркет представлені такі способи доставки:

<b>Нова Пошта</b> - доставка по всій Україні.

<b>Самовивіз</b> - доступний в Києві та Одесі.

<b>Доставка кур'єром</b> - по Києву 50 грн, в передмістя Києва від 100 грн.'''
delivery_method_en = '''Delivery methods in Service-Market:

<b>Nova Poshta</b> - delivery by Ukraine

<b>Collection</b> - in Kyiv and Odesa.

<b>Messenger Delivery</b> - in Kyiv  50 uah,  suburb from 100 uah.'''

payment_method_ru = '''Оплатить покупку можно:

<b>Наличными</b> - курьеру, или при самовывозе.

<b>On-line</b> - с помощью системы Приват24

<b>Наложенный платеж</b> - при выборе доставки "Новой Почтой".

<b>На расчетный счет ПриватБанка</b> - через терминалы самообслуживания или онлайн-банкинг.'''
payment_method_ukr = '''Сплатити за покупку можна:

<b>Готівкою</b> - кур'єру, або при самовивозі.

<b>On-line</b> - за допомогою системи Приват24

<b>Накладений платіж</b> - при виборі доставки "Новою Поштою".

<b>На розрахунковий рахунок ПриватБанку</b> - через термінали самообслуговування або онлайн-банкінг.'''
payment_method_en = '''Methods of Payment:

<b>Cash</b> - on collection point or to the courier.

<b>On-line</b> - you can pay for the purchase by Privat24

<b>Cash on Delivery</b> - if delivery by "Nova Poshta".

<b>For a Current Bank Account</b> - via bank terminals or online banking.'''

how_can_opt_ru = '''Если вы являетесь мастером по ремонту техники, представителем сервисного центра или магазина по продаже запчастей и планируете покупать товары в больших количествах, свяжитесь, пожалуйста с нашим оптовым отделом: 

[067 823 33 55](tel:+380678233355)

(067) 257-55-77

(050) 451 50 20

(063) 499 39 85

sales@service-market.com.ua

Подробнее о сотрудничестве с Сервис-Маркет читайте [здесь](https://www.service-market.com.ua/page/cooperation?utm_source=telegram&utm_medium=telegram_bot)'''
how_can_opt_ukr = '''Якщо ви є майстром з ремонту техніки, представником сервісного центру або магазину з продажу запчастин та плануєте купувати товари у великій кількості, зв'яжіться, будь ласка, з нашим оптовим відділом: 

(067) 823-33-55

(067) 257-55-77

(050) 451 50 20

(063) 499 39 85

sales@service-market.com.ua

Детальніше про співробітництво з Сервіс-Маркет читайте [тут](https://www.service-market.com.ua/ua/page/cooperation?utm_source=telegram&utm_medium=telegram_bot)'''
how_can_opt_en = '''If you are a master of appliance repair or representative of service center or shop and plan to buy goods in large quantities, please, contact our wholesale department:

(067) 823-33-55

(067) 257-55-77

(050) 451 50 20

(063) 499 39 85

sales@service-market.com.ua

Read more about cooperation with Service Market [here](https://www.service-market.com.ua/en/page/cooperation?utm_source=telegram&utm_medium=telegram_bot)'''

how_exchange_ru = '''Мы осуществляем возврат и обмен товаров надлежащего качества в соответствии с Законом «О защите прав потребителей».

Возврат и обмен товаров возможен в течение 14 дней после получения товара покупателем. Некоторые товары имеют Гарантию на возврат средств 6 месяцев. 

Подробнее о процедуре возврата читайте на [сайте](https://www.service-market.com.ua/obmen-i-vozvrat?utm_source=telegram&utm_medium=telegram_bot)'''
how_exchange_ukr = '''Ми здійснюємо повернення та обмін товарів належної якості згідно Закону «Про захист прав споживачів».

Повернення та обмін можливі протягом 14 днів після отримання товару покупцем. Деякі товари мають Гарантію на повернення коштів 6 місяців. 

Детальніше про процедуру повернення читайте на [сайті](https://www.service-market.com.ua/ua/obmen-i-vozvrat?utm_source=telegram&utm_medium=telegram_bot)'''
how_exchange_en = '''We do the return and exchange of goods in accordance with the Law «Concerning the Protection of Consumers' Rights».

Return and exchange of goods are possible within 14 days after receipt of the good. Some goods have 6-month money-back guarantee. Read more about return procedure [here](https://www.service-market.com.ua/en/obmen-i-vozvrat)'''

contacts_ru = '''<b>Телефоны:</b> 

0(800) 752 110
(067) 468 33 55
(050) 468 33 55
(093) 468 33 55
(044) 221-13-35

<b>Колл-центр работает:</b>

Пн-Пт: 09:00-20:00
Сб, Вс: 10:00-16:00
<b>E-Mail:</b> info@service-market.com.ua
<b>Сайт:</b> https://www.service-market.com.ua/?utm_source=telegram&utm_medium=telegram_bot

<b>Пункты выдачи:</b>

<b>Киев, Почайна:</b>
ул.Вербовая, 19
На территории рынка "Антикварных Вещей" (рынок "Петрик"), ряд А16, место 1.
<i>Пн-Пт 9:00-20:00,</i>
<i>Сб 10:00-16:00, Вс - выходной</i>.
<b>Объект на карте:</b>
https://bit.ly/2pAhYjc

<b>Киев, Позняки:</b>
ул.А.Мишуги, 9А (2-й этаж).
<i>Пн-Пт 9:00-19:00</i>, 
<i>Сб 10:00-16:00, Вс - выходной.</i>
<b>Объект на карте:</b>
https://bit.ly/2n8Ttsx

<b>Одесса:</b>
ул.Большая Арнаутская, 117.
<i>Пн-Пт с 10:00 до 19:00</i>, 
<i>Сб с 10:00 до 16:00, Вс - выходной.</i>
<b>Объект на карте:</b>
https://bit.ly/2ncEH40'''

contacts_ukr = '''<b>Телефони: </b>

0(800) 752 110
(067) 468 33 55
(050) 468 33 55
(093) 468 33 55
(044) 221-13-35

<b>Колл-центр працює:</b>

Пн-Пт: 09:00-20:00
Сб, Нд: 10:00-16:00

<b>E-Mail:</b> info@service-market.com.ua
<b>Сайт:</b> https://www.service-market.com.ua/?utm_source=telegram&utm_medium=telegram_bot

<b>Пункти видачі:</b>

<b>Київ, Почайна:</b>
вул.Вербова, 19
На території ринку "Антикварних Речей" (ринок "Петрик"), ряд А16, місце 1.
<i>Пн-Пт 9:00-20:00,</i> 
<i>Сб 10:00-16:00, Нд - вихідний.</i>
<b>Об'єкт на карті:</b>
https://bit.ly/2pAhYjc

<b>Київ, Позняки:</b>
вул.О.Мішуги, 9А (2-й поверх).
<i>Пн-Пт 9:00-19:00</i>, 
<i>Сб 10:00-16:00, Нд- вихідний.</i>
<b>Об'єкт на карті:</b>
https://bit.ly/2n8Ttsx

<b>Одеса:</b>
вул.Велика Арнаутська, 117.
<i>Пн-Пт 10:00-19:00,</i> 
<i>Сб 10:00-16:00, Нд - вихідний.</i>
<b>Об'єкт на карті:</b>
https://bit.ly/2ncEH40'''

contacts_en = '''<b>Phones:</b> 

0(800) 752 110
(067) 468 33 55
(050) 468 33 55
(093) 468 33 55
(044) 221-13-35

<b>Call-center working hours:</b>

<i>Mon-Fri: 09:00-20:00</i>
<i>Sat, Sun: 10:00-16:00</i>

<b>E-Mail:</b> info@service-market.com.ua
<b>Website:</b> https://www.service-market.com.ua/?utm_source=telegram&utm_medium=telegram_bot

<b>Collection points:</b>

<b>Kyiv, Pochayna:</b>
19 Verbova str
In the market of "Antique Things" (market "Petryk"), place 1, row A16
<i>Mon-Fri 9:00-20:00,</i> 
<i>Sat 10:00-16:00, Sun- closed.</i>
<b>Object on the map:</b>
https://bit.ly/2pAhYjc

<b>Kyiv, Poznyaky:</b>
9А Mishugi str (2nd floor).
<i>Mon-Fri 9:00-19:00,</i> 
<i>Sat 10:00-16:00, Sun - closed.</i>
<b>Object on the map:</b>
https://bit.ly/2n8Ttsx

<b>Odesa:</b>
117 Bolshaya Arnaytskaya str.
<i>Mon-Fri 10:00-19:00,</i> 
<i>Sat 10:00-16:00, Sun- closed.</i>
<b>Object on the map:</b>
https://bit.ly/2ncEH40'''

send_photo_ru = 'Добавьте фотографию объекта и фотографию наклейки производителя для более точного подбора (до 2х фото)'
send_photo_ukr = "Додайте фото об'єкта та фотографію наклейки виробника для більш точного підбору (до 2х фото)"
send_photo_en = 'Add a photo of object and manufacturer sticker for exact matching (up to 2 photos)'

photo_sended_ru = '✅ Фото отправлено, менеджер свяжется с вами в ближайшее время'
photo_sended_ukr = "✅ Фото відправлено, менеджер зв'яжеться з вами найближчим часом"
photo_sended_en = '✅ Photo sent, the manager will contact you shortly'

photo_loaded_ru = '✅ Фото загружено'
photo_loaded_ukr = '✅ Фото завантажено'
photo_loaded_en = '✅ Photo uploaded'

enter_photos_ru = 'Добавьте фотографию объекта и фотографию наклейки производителя для более точного подбора (до 2х фото), когда закончите, нажмите на "Отправить"'
enter_photos_ukr = "Додайте фото об'єкта та фотографію наклейки виробника для більш точного підбору (до 2х фото), коли закінчите, натисніть на 'Відправити'"
enter_photos_en = 'Add a photo of object and manufacturer sticker for exact matching (up to 2 photos). When you are done, click on "Submit"'

canceled_ru = 'Операция отменена'
canceled_ukr = 'Операція скасована'
canceled_en = 'Operation canceled'

too_many_photos_ru = 'Можно загрузить не более 10-ти фото'
too_many_photos_ukr = 'Можна завантажити не більше 10-ти фото'
too_many_photos_en = 'You can upload no more than 10 photos'

incorrect_photo_ru = 'Ошибка загрузки фотографии. Убедитесь, что отправляется фото как изображения, а не как файл.'
incorrect_photo_ukr = 'Помилка завантаження фотографіі. Переконайтесь, що фото надсилається як зображення, а не як файл.'
incorrect_photo_en = 'Failed to load photos. Make sure that photo is sent as an image, not as a file.'

no_photos_ru = 'Нужно загрузить хотя бы одно фото чтобы отправить'
no_photos_ukr = 'Потрібно завантажити хоча б одне фото щоб відправити'
no_photos_en = 'You must upload at least one photo to send'


